package tw.edu.ncu.cc.manage.util;

public class SignVersion {
    public static final int version =1;
    public static final String updateDate="20140929";
    public static final String signContent="上次修改日期： "+updateDate+" </br>"+
            "</br>"+
            "歡迎使用 <strong>NCU</strong>APP<strong>.</strong>！</br>"+
            "</br>"+
            "感謝您使用我們的產品和服務 (以下簡稱「服務」)。「服務」是由 <strong>NCU</strong>APP<strong>.</strong> Inc. (地址為 1600 Amphitheatre Parkway, Mountain View, CA 94043, United States) (以下簡稱「<strong>NCU</strong>APP<strong>.</strong>」) 提供。</br>"+
            "</br>"+
            "只要您使用「服務」，即表示您同意本條款，故請詳閱本條款內容。</br>"+
            "</br>"+
            "由於「服務」種類繁多，因此某些「服務」可能會有附加條款或產品規定 (包括年齡限制)。附加條款將與相關「服務」一併提供；當您使用該「服務」時，該等附加條款即成為您與我們所訂協議的一部分。</br>"+
            "</br>"+
            "使用「服務」</br>"+
            "</br>"+
            "您必須遵守「服務」中向您提供的所有政策。</br>"+
            "</br>"+
            "請勿濫用「服務」。舉例來說，您不應干擾「服務」運作，亦不得試圖透過我們所提供的介面和操作說明以外的方法存取「服務」。您僅可於法律 (包括適用的出口及再出口管制法律和法規) 允許範圍內使用「服務」。如果您未遵守我們的條款或政策，或是如果我們正在調查疑似違規行為，我們可能會暫停或終止向您提供「服務」。</br>"+
            "</br>"+
            "使用「服務」並不會將「服務」或您所存取內容的任何智慧財產權授予您。除非相關內容的擁有者同意或法律允許，否則您一律不得使用「服務」中的內容。本條款並未授權您可使用「服務」中所採用的任何品牌標示或標誌。請勿移除、遮蓋或變造「服務」所顯示或隨附顯示的任何法律聲明。</br>"+
            "</br>"+
            "「服務」中顯示的部分內容並非 <strong>NCU</strong>APP<strong>.</strong> 所有，這類內容應由其提供實體承擔全部責任。我們可對內容進行審查，以判斷其是否違法或違反 <strong>NCU</strong>APP<strong>.</strong> 政策，並可移除或拒絕顯示我們合理確信違反 我們政策或法律的內容。不過，這不表示我們一定會對內容進行審查，因此請勿如此認定。</br>"+
            "</br>"+
            "有關您對「服務」的使用，我們會向您發送服務公告、行政管理訊息和其他資訊；您可取消接收其中某些通訊內容。</br>"+
            "</br>"+
            "<strong>NCU</strong>APP<strong>.</strong> 的部分「服務」可以在行動裝置上使用。但請勿在會分散注意力的情況下使用這些「服務」，以免違反交通或安全法規。</br>"+
            "</br>"+
            "您的 <strong>NCU</strong>APP<strong>.</strong> 帳戶</br>"+
            "</br>"+
            "您可能需有「<strong>NCU</strong>APP<strong>.</strong> 帳戶」才能使用我們的某些「服務」。您可自行建立「<strong>NCU</strong>APP<strong>.</strong> 帳戶」，或由管理人 (例如您的雇主或教育機構) 為您指派「<strong>NCU</strong>APP<strong>.</strong> 帳戶」。如果您使用的是管理人指派給您的「<strong>NCU</strong>APP<strong>.</strong> 帳戶」，可能需適用不同條款或附加條款，而且您的管理人可能可以存取或停用您的帳戶。</br>"+
            "</br>"+
            "為保護您的 <strong>NCU</strong>APP<strong>.</strong> 帳戶，請務必保管好您的密碼並對外保密。您必須為自己 <strong>NCU</strong>APP<strong>.</strong> 帳戶中的所有活動負責，因此請避免在第三方應用程式中重複使用您的 <strong>NCU</strong>APP<strong>.</strong> 帳戶密碼。如果您發現自己的 <strong>NCU</strong>APP<strong>.</strong> 帳戶或密碼遭人盜用，請按照這裡的指示操作。</br>"+
            "</br>"+
            "隱私權與著作權保護</br>"+
            "</br>"+
            "<strong>NCU</strong>APP<strong>.</strong> 的《隱私權政策》會說明當您使用「服務」時，我們會如何處理您的個人資料並保護您的隱私權。您使用「服務」，即表示您同意 <strong>NCU</strong>APP<strong>.</strong> 可依據我們的隱私權政策的規定使用這類資料。</br>"+
            "</br>"+
            "我們會按照美國《數位千禧年著作權法》所規定的程序，對涉嫌著作權侵權通知做出回應，並終止一再侵權者的帳戶。</br>"+
            "</br>"+
            "我們會提供相關資訊，協助著作權人在線上管理其智慧財產。如果您認為有人侵犯您的著作權而需要通知我們，可以前往我們的「說明中心」，瞭解如何提出通知，並查詢 <strong>NCU</strong>APP<strong>.</strong> 有關通知回應的政策規定。</br>"+
            "</br>"+
            "您儲存在「服務」中的內容</br>"+
            "</br>"+
            "部分「服務」可讓您上傳、提交、儲存、傳送或接收內容；您仍保有相關內容中您擁有的智慧財產權。簡而言之，屬於您的依舊是您的。</br>"+
            "</br>"+
            "當您將內容上載、提交、儲存或傳送到「服務」，或在「服務」接收內容，或透過「服務」進行以上操作時，即表示您授予 <strong>NCU</strong>APP<strong>.</strong> (及我們的合作夥伴) 全球通用的授權，可使用、代管、儲存、重製、修改、製作衍生作品 (例如翻譯、改編或變更您的內容，使其更加配合我們的「服務」)、傳播、發佈、公開操作、公開展示與散佈這類內容。您於本項授權授予的權利僅限用於營運、宣傳與改善「服務」，以及開發新的服務。即使您停止使用「服務」，本項授權仍持續具有效力 (例如對您先前加到「<strong>NCU</strong>APP<strong>.</strong> 地圖」之商家資訊的授權)。部分「服務」可讓您存取與移除先前提交至該「服務」的內容。此外，某些「服務」會有條款或設定縮限我們對提交至該類「服務」之內容的使用範圍。請確認您擁有必要權利，可就您提交至「服務」的任何內容授予我們本項授權。</br>"+
            "</br>"+
            "我們的自動系統會分析您的內容 (包括電子郵件)，以提供與您個人相關的產品功能，例如自訂搜尋結果、個人化廣告，以及垃圾內容與惡意軟體偵測功能。當您使用我們的系統傳送、接收及儲存內容時，系統就會進行分析。</br>"+
            "</br>"+
            "如果您擁有 <strong>NCU</strong>APP<strong>.</strong> 帳戶，我們可能會在 <strong>NCU</strong>APP<strong>.</strong> 的「服務」(包括廣告和其他商業內容) 中顯示您的個人資料名稱和相片，以及您在 <strong>NCU</strong>APP<strong>.</strong> 或您的 <strong>NCU</strong>APP<strong>.</strong> 帳戶所連結的第三方應用程式中的動態 (例如 +1、您撰寫的評論以及您發表的留言)。我們會尊重您在 <strong>NCU</strong>APP<strong>.</strong> 帳戶中選擇的分享或公開程度設定。舉例來說，您可以設定不在廣告中顯示自己的名稱和相片。</br>"+
            "</br>"+
            "如要進一步瞭解 <strong>NCU</strong>APP<strong>.</strong> 使用與儲存內容的方式，請參閱相關「服務」的隱私權政策或附加條款。如果您就「服務」提供意見或建議，我們可使用您的意見或建議，對您不負任何義務。</br>"+
            "</br>"+
            "有關「服務」所含軟體</br>"+
            "</br>"+
            "如果「服務」需有或內含可下載軟體，該軟體可能會在提供新版或新功能時，在您的裝置上自動更新。部分「服務」可以讓您調整您的自動更新設定。</br>"+
            "</br>"+
            "<strong>NCU</strong>APP<strong>.</strong> 授予您全球通用、免權利金、不得轉讓、非專屬的個人使用授權，讓您使用 <strong>NCU</strong>APP<strong>.</strong> 提供給您的、包含在「服務」中的軟體。本授權僅供您以這些條款允許之方式，使用 <strong>NCU</strong>APP<strong>.</strong> 提供之「服務」並享用其利益。除非法律禁止下列限制，或除非您已取得我們的書面許可，否則您不得複製、修改、散佈、銷售或出租「服務」的任何部分或其中包含的軟體，也不得對該軟體進行逆向工程或試圖擷取其原始程式碼。</br>"+
            "</br>"+
            "開放原始碼軟體對我們非常重要。我們可能會根據開放原始碼授權 (之後會提供給您)，向您提供「服務」中使用之部分軟體，而該開放原始碼授權中可能會有些規定的效力明確優先於本條款之部分條款。</br>"+
            "</br>"+
            "修改與終止「服務」</br>"+
            "</br>"+
            "我們會持續不斷變更並改進「服務」。我們可能會新增或移除功能或特性，也可能會完全暫停或停止某項「服務」。</br>"+
            "</br>"+
            "您隨時都可以停止使用「服務」，不過我們並不希望您這麼做。<strong>NCU</strong>APP<strong>.</strong> 也可能隨時停止向您提供「服務」，或對「服務」附加或設定新的限制。</br>"+
            "</br>"+
            "我們認為您的資料是屬於您所有，因此有必要維護您對這類資料的存取。當我們中止某項「服務」時，只要合理可行，我們都會給您合理的事先通知，讓您有機會能將資訊自該「服務」匯出。</br>"+
            "</br>"+
            "我們的擔保與免責聲明</br>"+
            "</br>"+
            "我們會以商業上合理的技術與注意程度提供「服務」，希望您會盡情使用。但關於「服務」，有些事情我們不予保證。</br>"+
            "</br>"+
            "除本條款或額外條款中明示規定者外，<strong>NCU</strong>APP<strong>.</strong> 或其供應商或經銷商均不對「服務」做出任何特定保證。例如，我們不會就「服務」中的內容、「服務」之特定功能及其可靠性、可用性和符合您的需求的能力，做出任何承諾。我們僅以「現狀」提供「服務」。</br>"+
            "</br>"+
            "部分司法管轄區會規定應提供特定擔保，例如對適銷性、特殊用途適用性及未侵權之默示擔保。凡法律准許時，我們均排除一切擔保責任。</br>"+
            "</br>"+
            "對「服務」的責任</br>"+
            "</br>"+
            "凡法律准許時，<strong>NCU</strong>APP<strong>.</strong> 與 <strong>NCU</strong>APP<strong>.</strong> 的供應商和經銷商對所失利益、收入或資料、財務損失或間接、特殊、衍生性、懲戒性或處罰性損害賠償均不負責。</br>"+
            "</br>"+
            "在法律准許範圍內，<strong>NCU</strong>APP<strong>.</strong> 與其供應商和經銷商對依本條款所提出任何請求之總責任 (包括對任何默示擔保之責任)，均不超過您就使用「服務」而向 <strong>NCU</strong>APP<strong>.</strong> 支付的金額 (或者 <strong>NCU</strong>APP<strong>.</strong> 亦可選擇再向您提供該「服務」)。</br>"+
            "</br>"+
            "不論在任何情況下，<strong>NCU</strong>APP<strong>.</strong> 與其供應商和經銷商對無法合理預見之任何損失或損害均不負責。</br>"+
            "</br>"+
            "公司行號使用 <strong>NCU</strong>APP<strong>.</strong> 服務</br>"+
            "</br>"+
            "如果您是代表某公司使用「服務」，即表示該公司接受本條款。該公司必須就任何因使用「服務」或違反本條款而引起或相關的請求、訴訟或法律行動 (包括承擔所有因請求、損失、損害、訴訟、判決、訴訟費用和律師費用而產生的任何責任或費用)，向 <strong>NCU</strong>APP<strong>.</strong> 及其關係企業、主管人員、代理人和員工做出補償，並使其不受損害。</br>"+
            "</br>"+
            "有關本條款的說明</br>"+
            "</br>"+
            "我們可能會修改本條款或適用於某「服務」之任何額外條款，以 (例如)反映法律之變更或「服務」之變動。您應定期查閱本條款內容。這些條款如有修訂，我們會在本網頁發佈通知。我們會在相關「服務」中公布已修訂額外條款的通知。變更不會回溯適用，並將於公布變更起十四天或更長時間後方始生效。不過，針對某項「服務」新功能的變更，或基於法律理由而為之變更，將立即生效。如果您不同意某項「服務」之修訂條款，則請停止使用該「服務」。</br>"+
            "</br>"+
            "如果本條款與額外條款牴觸時，就該牴觸項目而言，應以額外條款為準。</br>"+
            "</br>"+
            "本條款規範 <strong>NCU</strong>APP<strong>.</strong> 與您之間的關係，並不會衍生任何第三人受益權。</br>"+
            "</br>"+
            "如果您不遵守本條款，而我們並未立即採取行動，這並不表示我們要放棄任何原本即有的權利 (例如未來再採取行動的權利)。</br>"+
            "</br>"+
            "發生特定條款無法執行的情況時，並不會影響任何其他條款。</br>"+
            "</br>"+
            "美國加州法律 (加州之法律衝突規則除外) 應適用於因本條款或「服務」所生或與其相關之任何爭議。本條款或「服務」所生或與其相關之所有主張應完全由美國加州聖塔克拉拉郡之聯邦法院或州法院審理，您與 <strong>NCU</strong>APP<strong>.</strong> 皆同意受上述法院之屬人管轄。</br>"+
            "</br>"+
            "如需 <strong>NCU</strong>APP<strong>.</strong> 的聯絡資訊，請造訪我們的聯絡網頁。";
}
